# -*- coding: utf-8 -*-

publicContentStatus = {
    '草稿': 0,
    '审核中': 1,
    '未通过': 2,
    '已发布': 3,
    '处理中': 4,
    '处理失败': 5,
    '管理员下线': 6,
    '作者下线': 7,
    '待发布': 8,
    '已删除': 9,
    '作者删除': 10,
    'MCN主账号下线': 11,
}

channelContentStatus = {
    '百家号': {
        'rejected': '未通过',
        'publish': '已发布',
    },
    '趣头条': {
        'video': {
            0: '草稿',
            2: '审核中',
            3: '未通过',
            4: '已发布',
            5: '已删除',
            8: '处理失败',
        },
        'article': {
            1: '草稿',
            5: '审核中',
            2: '已发布',
            3: '未通过',
            4: '已删除',
        },
    },
    '搜狗号': {
        1: '已发布',
        40: '未通过',
        134: '草稿'
    },
}